H4W9/ESP32_Sudoku/ESP32_Sudoku.ino
/* ============================================================================
   ESP32 Sudoku — Pancake (ESP32-C5, ST7796 320x480, FT6336 capacitive touch)
                  Marauder V8 (ESP32-C5, ILI9341 240x320, XPT2046 resistive)
   ============================================================================
   A touch Sudoku that wears the H4W9 UI shell shared with ESP32_Scrabble
   (header with back button + battery/RAM status corner, momentum-scrolling list
   menus, chip settings rows, 21 colour themes). The Scrabble word engine is
   replaced by a Sudoku engine (sudoku.*) and a board view; the puzzle bank
   (puzzles.h) is embedded, so no SD card is required to play — the card, if
   present, only stores the in-progress game.

   Arduino IDE settings:
     Board            : ESP32C5 Dev Module
     Flash Size       : 8MB
     Partition Scheme : Custom  ->  partitions.csv in this folder
     Flash Frequency  : 80 MHz
     PSRAM            : Enabled     <-- required, the board view composites into
                                        a full-screen PSRAM sprite

   Requires the patched TFT_eSPI-ESP32-C5 library with User_Setup_Select.h set to
   the matching board's User_Setup_marauder_*.h.
   ============================================================================ */

#include "configs.h"

#include <Arduino.h>
#include <SPI.h>
#include <SD.h>
#include <SPIFFS.h>
#include <Wire.h>
#include <ArduinoJson.h>

#include "ft6336.h"
#include "theme.h"
#include "board_theme.h"
#include "vlw.h"
#include "sudoku.h"
#include "puzzles.h"

// Picoware core (panel init, touch, view manager).
#include "src/Picoware/internal/boards.hpp"
#include "src/Picoware/internal/gui/draw.hpp"
#include "src/Picoware/internal/system/input.hpp"
#include "src/Picoware/internal/system/view.hpp"
#include "src/Picoware/internal/system/view_manager.hpp"
using namespace Picoware;

// ── Globals ────────────────────────────────────────────────────────────────
#ifdef HAS_C5_SD
SPIClass sharedSPI(SPI);
#endif

static ViewManager *vm    = nullptr;   // owns Draw (panel) + InputManager (touch)
static TFT_eSPI    *tft   = nullptr;   // raw panel (from Draw) for the shell screens
static TouchInput  *touch = nullptr;   // touch source (from InputManager)
static Theme        theme;             // colour theme + accent + font + brightness

// Theme-driven colours (macros so every use follows the current theme).
#define COL_BG     (theme.bg())
#define COL_FG     (theme.fg())
#define COL_ACCENT (theme.hdr())
#define COL_DIM    (theme.dim())
#define COL_SEL    (theme.sel())
static const uint16_t COL_OK = 0x07E0;   // status green (theme-independent)

static const int SCRW = TFT_WIDTH;
static const int SCRH = TFT_HEIGHT;

// Shell layout — matches H4W9 (header 28, nav 28, list rows 34/26).
static const int HDRH     = 28;
static const int NAVH     = 28;
#ifdef MARAUDER_V8
static const int ITEMH    = 26;
#else
static const int ITEMH    = 34;
#endif
static const int CONTENTY = HDRH;

static bool g_sdOk = false;            // SD mounted (auto-save target; else SPIFFS)

// ── Sudoku game state ───────────────────────────────────────────────────────
static Sudoku  g_sud;
static bool    g_gameActive = false;   // a game exists (Continue is meaningful)
static int     g_sel        = -1;      // selected cell 0..80, or -1
static bool    g_notesMode  = false;   // number taps write pencil marks
static bool    g_hintCell[81];         // which cells were filled by Hint (for colour)
static uint16_t g_mistakes  = 0;
static uint16_t g_hintsUsed = 0;
static uint32_t g_elapsedMs = 0;       // accumulated play time (paused segments)
static uint32_t g_startMs   = 0;       // start of the current running segment
static bool    g_running    = false;

// ── Sudoku settings (persisted /sudoku_cfg.json) ────────────────────────────
static bool    g_hlPeers    = true;    // shade the selection's row/col/box
static bool    g_hlSame     = true;    // shade cells holding the same digit
static bool    g_autoNotes  = true;    // placing a digit erases that pencil mark from peers
static bool    g_showTimer  = true;
static uint8_t g_mistakeLim = 0;       // 0 = off, else 3 or 5 strikes then game over

// ── Statistics (persisted /sudoku_stats.json) ───────────────────────────────
static uint16_t g_played[4] = {0,0,0,0};
static uint16_t g_won[4]    = {0,0,0,0};
static uint32_t g_best[4]   = {0,0,0,0};   // best solve time (seconds), 0 = none

// Kept below the type declarations above: Arduino inserts its auto-generated
// prototypes ahead of the FIRST function, so any function defined above these
// globals would push the prototypes above them and break the build.

// ════════════════════════════════════════════════════════════════════════════
//  Shell — transplanted from the H4W9 UI (Scrabble/FlipSocial), WiFi removed.
// ════════════════════════════════════════════════════════════════════════════

#ifndef HAS_CAP_TOUCH
// Resistive touch calibration (V8). The 5 uint16 blob is TFT_eSPI's own format.
static const char *TOUCH_CAL_FILE = "/sud_touch.dat";
static bool touchCalLoad(uint16_t *cal) {
  File f = SPIFFS.open(TOUCH_CAL_FILE, "r");
  if (!f) return false;
  bool ok = (f.read((uint8_t *)cal, sizeof(uint16_t) * 5) == sizeof(uint16_t) * 5);
  f.close();
  return ok;
}
static void touchCalSave(const uint16_t *cal) {
  File f = SPIFFS.open(TOUCH_CAL_FILE, "w");
  if (!f) return;
  f.write((const uint8_t *)cal, sizeof(uint16_t) * 5);
  f.close();
}
static void touchCalRun() {
  uint16_t cal[5];
  tft->fillScreen(TFT_BLACK);
  tft->setTextColor(TFT_WHITE, TFT_BLACK);
  tft->setTextDatum(MC_DATUM);
  tft->drawString("Touch Calibration", SCRW / 2, SCRH / 2 - 24, 4);
  tft->drawString("Tap each corner arrow", SCRW / 2, SCRH / 2 + 6, 2);
  tft->setTextDatum(TL_DATUM);
  delay(1500);
  tft->fillScreen(TFT_BLACK);
  tft->calibrateTouch(cal, TFT_MAGENTA, TFT_BLACK, 15);
  tft->setTouch(cal);
  touchCalSave(cal);
}
static void touchCalInit() {
  uint16_t cal[5];
  if (touchCalLoad(cal)) tft->setTouch(cal);
  else                   touchCalRun();
}
#endif // !HAS_CAP_TOUCH

static bool waitTap(uint16_t &x, uint16_t &y, uint32_t timeoutMs = 0) {
  uint32_t start = millis();
  bool wasDown = touch->isPressed();
  for (;;) {
    touch->run();
    bool down = touch->isPressed();
    if (down && !wasDown) { x = touch->x(); y = touch->y(); return true; }
    wasDown = down;
    if (timeoutMs && (millis() - start) > timeoutMs) return false;
    delay(8);
    yield();
  }
}
static bool inRect(uint16_t x, uint16_t y, int rx, int ry, int rw, int rh) {
  return (int)x >= rx && (int)x < rx + rw && (int)y >= ry && (int)y < ry + rh;
}

