H4W9/ESP32_Sudoku/ESP32_Sudoku.ino
// Theme / brightness plumbing
static void applyBrightness() {
#if ESP_ARDUINO_VERSION_MAJOR >= 3
  ledcWrite(TFT_BL, theme.duty());
#else
  ledcWrite(0, theme.duty());
#endif
}
static void applyThemeToViewManager() {
  if (!vm) return;
  vm->setBackgroundColor(theme.bg());
  vm->setForegroundColor(theme.fg());
  vm->setSelectedColor(theme.sel());
}

// Smooth-font drawing (VLW). Font numbers 1/2/4/6 map to 10/14/22/28 px.
static void drawStr(const String &s, int32_t x, int32_t y, uint8_t fontNum) {
  vlwLoad(*tft, fontNum, g_vlw_cur_tft);
  char buf[160];
  vlwPrivToUtf8(s.c_str(), buf, sizeof(buf));
  tft->drawString(buf, x, y);
}
static int16_t strWidth(const String &s, uint8_t fontNum) {
  return vlwTextWidth(vlwData(fontNum), s.c_str());
}
static void sprStr(TFT_eSprite &g, const uint8_t *&track,
                   const String &s, int32_t x, int32_t y, uint8_t fontNum) {
  vlwLoad(g, fontNum, track);
  char buf[160];
  vlwPrivToUtf8(s.c_str(), buf, sizeof(buf));
  g.drawString(buf, x, y);
}

// Status LED.
#ifdef HAS_ACT_LED
static bool g_actLedReady = false;
static void ledActArm() {
  if (g_actLedReady) return;
  pinMode(ACT_LED_PIN, OUTPUT);
  digitalWrite(ACT_LED_PIN, LOW);
  g_actLedReady = true;
}
static void ledActSet(bool on) {
  ledActArm();
  digitalWrite(ACT_LED_PIN, (on && theme.led_bright > 0) ? HIGH : LOW);
}
static inline void ledOff() { ledActSet(false); }
static inline void ledOn()  { ledActSet(true); }
static inline void ledBlinkOk(uint16_t ms = 150) { ledActSet(true); delay(ms); ledActSet(false); }
static inline void ledPreview() { ledActSet(true); }
#else
#ifdef RGB_BUILTIN
  #define PW_RGB_PIN RGB_BUILTIN
#else
  #define PW_RGB_PIN LED_BUILTIN
#endif
static inline void ledGap() { delayMicroseconds(300); }
static void ledRGB(uint8_t r, uint8_t g, uint8_t b) {
  uint16_t s = theme.led_bright;
  ledGap();
  rgbLedWrite(PW_RGB_PIN, (uint8_t)((uint16_t)r * s / 20),
                          (uint8_t)((uint16_t)g * s / 20),
                          (uint8_t)((uint16_t)b * s / 20));
}
static inline void ledOff() { ledGap(); rgbLedWrite(PW_RGB_PIN, 0, 0, 0); }
static inline void ledOn()  { ledRGB(0, 80, 255); }
static inline void ledBlinkOk(uint16_t ms = 150) { ledRGB(0, 255, 0); delay(ms); ledOff(); }
static inline void ledPreview() { ledRGB(0, 160, 255); }
#endif // HAS_ACT_LED

// Battery fuel gauge (MAX17048, I2C 0x36, shared bus)
static int      g_battPct = -1;
static bool     g_battOk  = false;
static uint32_t g_battMs  = 0;
static void battInit() {
  Wire.beginTransmission(0x36);
  g_battOk = (Wire.endTransmission() == 0);
  Serial.println(g_battOk ? F("[Battery] MAX17048 OK") : F("[Battery] MAX17048 not found"));
}
static void battUpdate() {
  if (!g_battOk) return;
  Wire.beginTransmission(0x36);
  Wire.write(0x04);
  if (Wire.endTransmission(false) != 0) { g_battOk = false; return; }
  Wire.requestFrom((uint8_t)0x36, (uint8_t)2);
  if (Wire.available() < 2) return;
  uint8_t hi = Wire.read();
  Wire.read();
  g_battPct = (hi > 100) ? 100 : hi;
  g_battMs  = millis();
}

// Rendering helpers
static String memShort(size_t bytes) {
  if (bytes >= 1024UL * 1024UL) {
    uint32_t tenths = (uint32_t)((bytes * 10ULL) / (1024ULL * 1024ULL));
    return String(tenths / 10) + "." + String(tenths % 10) + "M";
  }
  return String((uint32_t)(bytes / 1024)) + "k";
}
static const int MEM_W = 46;
static int memX(bool showBack) { return showBack ? 46 : 6; }
static void drawHeaderMem(bool showBack) {
  int x = memX(showBack);
  tft->fillRect(x, 0, MEM_W, HDRH, COL_ACCENT);
  tft->setTextColor(COL_FG, COL_ACCENT);
  tft->setTextDatum(ML_DATUM);
  drawStr(String("D:") + memShort(ESP.getFreeHeap()), x, HDRH / 2 - 6, 1);
  size_t ps = ESP.getFreePsram();
  if (ps) drawStr(String("P:") + memShort(ps), x, HDRH / 2 + 6, 1);
  tft->setTextDatum(TL_DATUM);
}
// Battery % painted into the header's top-right (WiFi icon removed).
static void drawHeaderStatus() {
  if (g_battOk && (g_battMs == 0 || millis() - g_battMs > 10000)) battUpdate();
  const int clearW = 62;
  tft->fillRect(SCRW - clearW, 0, clearW, HDRH, COL_ACCENT);
  if (g_battPct >= 0) {
    char pct[8];
    snprintf(pct, sizeof(pct), "%d%%", g_battPct);
    tft->setTextColor(COL_FG, COL_ACCENT);
    tft->setTextDatum(MR_DATUM);
    drawStr(pct, SCRW - 6, HDRH / 2, 2);
  }
  tft->setTextDatum(TL_DATUM);
}

static void drawChevron(int bx, int by, int bw, int bh, bool right, uint16_t col) {
  int cx = bx + bw / 2, cy = by + bh / 2;
  if (right) tft->fillTriangle(cx - 3, cy - 5, cx - 3, cy + 5, cx + 4, cy, col);
  else       tft->fillTriangle(cx + 3, cy - 5, cx + 3, cy + 5, cx - 4, cy, col);
}
static void drawPlusMinus(int bx, int by, int bw, int bh, bool plus, uint16_t col) {
  int cx = bx + bw / 2, cy = by + bh / 2, r = 6;
  tft->fillRect(cx - r, cy - 1, 2 * r, 2, col);
  if (plus) tft->fillRect(cx - 1, cy - r, 2, 2 * r, col);
}

static void drawHeader(const String &title, bool showBack) {
  tft->fillRect(0, 0, SCRW, HDRH, COL_ACCENT);
  if (showBack) {
    tft->fillRoundRect(2, 3, 40, 22, 4, COL_ACCENT);
    tft->drawRoundRect(2, 3, 40, 22, 4, theme.neon(3, COL_DIM));
    drawChevron(2, 3, 40, 22, false, COL_FG);
  }
  tft->setTextColor(COL_FG, COL_ACCENT);
  tft->setTextDatum(MC_DATUM);
  {
    int lo = memX(showBack) + MEM_W + 4, hi = SCRW - 62;
    drawStr(title, (lo + hi) / 2, HDRH / 2, 2);
  }
  drawHeaderMem(showBack);
  drawHeaderStatus();
  tft->setTextDatum(TL_DATUM);
}
static bool backTapped(uint16_t x, uint16_t y) {
  return (int)y < HDRH && (int)x < 48;
}

static void drawNav(const char *l, const char *m, const char *r) {
  int y = SCRH - NAVH, third = SCRW / 3, bh = NAVH - 10, by = y + 5, bw = third - 10;
  tft->fillRect(0, y, SCRW, NAVH, COL_BG);
  tft->drawFastHLine(0, y, SCRW, theme.edge());
  const char *L[3] = { l, m, r };
  for (int i = 0; i < 3; i++) {
    if (!L[i] || !L[i][0]) continue;
    int cx = i * third + third / 2, bx = cx - bw / 2;
    tft->fillRoundRect(bx, by, bw, bh, 5, COL_ACCENT);
    tft->drawRoundRect(bx, by, bw, bh, 5, theme.neon(i, COL_DIM));
    tft->setTextColor(COL_FG, COL_ACCENT);
    tft->setTextDatum(MC_DATUM);
    drawStr(L[i], cx, by + bh / 2, 2);
  }
  tft->setTextDatum(TL_DATUM);
}
static int navHit(uint16_t x, uint16_t y) {
  if ((int)y < SCRH - NAVH) return -1;
  int c = (int)x / (SCRW / 3);
  return c > 2 ? 2 : c;
}

