H4W9/ESP32_Sudoku/ESP32_Sudoku.ino
// ── Config + stats persistence ──────────────────────────────────────────────
static void cfgLoad() {
  File f = SPIFFS.open("/sudoku_cfg.json", FILE_READ);
  if (!f) return;
  JsonDocument d;
  DeserializationError e = deserializeJson(d, f);
  f.close();
  if (e) return;
  if (!d["peers"].isNull())   g_hlPeers   = d["peers"].as<bool>();
  if (!d["same"].isNull())    g_hlSame    = d["same"].as<bool>();
  if (!d["autonote"].isNull())g_autoNotes = d["autonote"].as<bool>();
  if (!d["timer"].isNull())   g_showTimer = d["timer"].as<bool>();
  if (!d["mlimit"].isNull())  g_mistakeLim= d["mlimit"].as<uint8_t>();
  if (g_mistakeLim != 0 && g_mistakeLim != 3 && g_mistakeLim != 5) g_mistakeLim = 0;
}
static void cfgSave() {
  JsonDocument d;
  d["peers"]    = g_hlPeers;
  d["same"]     = g_hlSame;
  d["autonote"] = g_autoNotes;
  d["timer"]    = g_showTimer;
  d["mlimit"]   = g_mistakeLim;
  File w = SPIFFS.open("/sudoku_cfg.json", FILE_WRITE);
  if (!w) return;
  serializeJson(d, w);
  w.close();
}
static void statsLoad() {
  File f = SPIFFS.open("/sudoku_stats.json", FILE_READ);
  if (!f) return;
  JsonDocument d;
  DeserializationError e = deserializeJson(d, f);
  f.close();
  if (e) return;
  for (int i = 0; i < 4; i++) {
    g_played[i] = d["p"][i] | 0;
    g_won[i]    = d["w"][i] | 0;
    g_best[i]   = d["b"][i] | 0;
  }
}
static void statsSave() {
  JsonDocument d;
  JsonArray p = d["p"].to<JsonArray>();
  JsonArray w = d["w"].to<JsonArray>();
  JsonArray b = d["b"].to<JsonArray>();
  for (int i = 0; i < 4; i++) { p.add(g_played[i]); w.add(g_won[i]); b.add(g_best[i]); }
  File wf = SPIFFS.open("/sudoku_stats.json", FILE_WRITE);
  if (!wf) return;
  serializeJson(d, wf);
  wf.close();
}

// ── Game save/load (SD if present, else SPIFFS) ─────────────────────────────
// Binary layout, little-endian:
//   magic "SUD1"(4) ver(1) diff(1) idx(2) elapsedSec(4) mistakes(2) hints(2)
//   sel(2, 0xFFFF = none) given(41) cur(41) sol(41) notes(81*2) hintFlags(81)
static const char *SAVE_SPIFFS = "/sud_auto.sav";
static String savePath() { return g_sdOk ? String(SAVE_DIR "/auto.sav") : String(SAVE_SPIFFS); }

static void gameSave() {
  if (!g_gameActive) return;
  File f;
  if (g_sdOk) { SD.mkdir(SUDOKU_DIR); SD.mkdir(SAVE_DIR); f = SD.open(SAVE_DIR "/auto.sav", FILE_WRITE); }
  else        f = SPIFFS.open(SAVE_SPIFFS, FILE_WRITE);
  if (!f) return;
  uint32_t elapsed = g_elapsedMs / 1000 + (g_running ? (millis() - g_startMs) / 1000 : 0);
  uint8_t g41[41], c41[41], s41[41]; uint16_t notes[81];
  g_sud.packGiven(g41); g_sud.packValues(c41); g_sud.packSolution(s41); g_sud.copyNotes(notes);
  uint8_t hdr[19];
  memcpy(hdr, "SUD1", 4); hdr[4] = 1;
  hdr[5] = g_sud.difficulty();
  uint16_t idx = g_sud.bankIndex();      hdr[6] = idx & 0xFF; hdr[7] = idx >> 8;
  hdr[8]  = elapsed & 0xFF; hdr[9] = (elapsed >> 8) & 0xFF; hdr[10] = (elapsed >> 16) & 0xFF; hdr[11] = (elapsed >> 24) & 0xFF;
  hdr[12] = g_mistakes & 0xFF; hdr[13] = g_mistakes >> 8;
  hdr[14] = g_hintsUsed & 0xFF; hdr[15] = g_hintsUsed >> 8;
  uint16_t sel = (g_sel < 0) ? 0xFFFF : (uint16_t)g_sel; hdr[16] = sel & 0xFF; hdr[17] = sel >> 8;
  hdr[18] = g_notesMode ? 1 : 0;
  f.write(hdr, 19);
  f.write(g41, 41); f.write(c41, 41); f.write(s41, 41);
  f.write((uint8_t *)notes, 81 * 2);
  uint8_t hf[81]; for (int i = 0; i < 81; i++) hf[i] = g_hintCell[i] ? 1 : 0;
  f.write(hf, 81);
  f.close();
}
static bool gameLoad() {
  File f = g_sdOk ? SD.open(SAVE_DIR "/auto.sav", FILE_READ) : SPIFFS.open(SAVE_SPIFFS, FILE_READ);
  if (!f) return false;
  uint8_t hdr[19];
  if (f.read(hdr, 19) != 19 || memcmp(hdr, "SUD1", 4) != 0) { f.close(); return false; }
  uint8_t g41[41], c41[41], s41[41]; uint16_t notes[81]; uint8_t hf[81];
  if (f.read(g41, 41) != 41 || f.read(c41, 41) != 41 || f.read(s41, 41) != 41 ||
      f.read((uint8_t *)notes, 81 * 2) != 81 * 2 || f.read(hf, 81) != 81) { f.close(); return false; }
  f.close();
  uint8_t diff = hdr[5];
  uint16_t idx = hdr[6] | (hdr[7] << 8);
  g_sud.loadState(g41, c41, s41, notes, diff, idx);
  uint32_t elapsed = (uint32_t)hdr[8] | ((uint32_t)hdr[9] << 8) | ((uint32_t)hdr[10] << 16) | ((uint32_t)hdr[11] << 24);
  g_elapsedMs = elapsed * 1000UL;
  g_mistakes  = hdr[12] | (hdr[13] << 8);
  g_hintsUsed = hdr[14] | (hdr[15] << 8);
  uint16_t sel = hdr[16] | (hdr[17] << 8);
  g_sel = (sel == 0xFFFF) ? -1 : (int)sel;
  g_notesMode = hdr[18] != 0;
  for (int i = 0; i < 81; i++) g_hintCell[i] = hf[i] != 0;
  g_running = false;
  g_gameActive = true;
  return true;
}
static void gameDeleteSave() {
  if (g_sdOk) SD.remove(SAVE_DIR "/auto.sav");
  else        SPIFFS.remove(SAVE_SPIFFS);
}

// ════════════════════════════════════════════════════════════════════════════
//  Settings + About + Statistics
// ════════════════════════════════════════════════════════════════════════════
enum {
  SET_THEME = 0, SET_ACCENT, SET_FONT, SET_GRID,
  SET_PEERS, SET_SAME, SET_AUTONOTE, SET_TIMER, SET_MLIMIT,
  SET_BRIGHT, SET_LED, SET_ABOUT,
#ifndef HAS_CAP_TOUCH
  SET_CAL,
#endif
  SET_N
};
static const int SET_CHIP_MAX = SET_LED;   // rows 0..SET_LED draw chips

static String mlimitVal() { return g_mistakeLim == 0 ? String("Off") : String(g_mistakeLim); }
static String onOff(bool b) { return b ? String("On") : String("Off"); }

static String setChipVal(int row) {
  switch (row) {
    case SET_THEME:    return theme.themeName();
    case SET_ACCENT:   return theme.accentName();
    case SET_FONT:     return theme.fontColName();
    case SET_GRID:     return theme.boardPalName();
    case SET_PEERS:    return onOff(g_hlPeers);
    case SET_SAME:     return onOff(g_hlSame);
    case SET_AUTONOTE: return onOff(g_autoNotes);
    case SET_TIMER:    return onOff(g_showTimer);
    case SET_MLIMIT:   return mlimitVal();
    case SET_BRIGHT:   return String(theme.bright + 1) + "/20";
    case SET_LED:      return String(theme.led_bright) + "/20";
  }
  return "";
}
static void sprSettingRow(TFT_eSprite &spr, const uint8_t *&sf, int row, int sel, int y) {
  bool s = (row == sel);
  switch (row) {
    case SET_THEME:    sprChipRow(spr, sf, y, "Theme",       setChipVal(row), false, s, 0); break;
    case SET_ACCENT:   sprChipRow(spr, sf, y, "Accent",      setChipVal(row), false, s, 0); break;
    case SET_FONT:     sprChipRow(spr, sf, y, "Font Color",  setChipVal(row), false, s, theme.fontColPreview()); break;
    case SET_GRID:     sprInfoRow(spr, sf, y, "Grid Look",   setChipVal(row), s); break;
    case SET_PEERS:    sprChipRow(spr, sf, y, "Highlight Peers", setChipVal(row), false, s, 0); break;
    case SET_SAME:     sprChipRow(spr, sf, y, "Highlight Same",  setChipVal(row), false, s, 0); break;
    case SET_AUTONOTE: sprChipRow(spr, sf, y, "Auto-Erase Notes", setChipVal(row), false, s, 0); break;
    case SET_TIMER:    sprChipRow(spr, sf, y, "Show Timer",   setChipVal(row), false, s, 0); break;
    case SET_MLIMIT:   sprChipRow(spr, sf, y, "Mistake Limit", setChipVal(row), true, s, 0); break;
    case SET_BRIGHT:   sprChipRow(spr, sf, y, "Brightness",   setChipVal(row), true,  s, 0); break;
    case SET_LED:      sprChipRow(spr, sf, y, "LED",          setChipVal(row), true,  s, 0); break;
    case SET_ABOUT:    sprInfoRow(spr, sf, y, "About",        "", s); break;
#ifndef HAS_CAP_TOUCH
    case SET_CAL:      sprInfoRow(spr, sf, y, "Calibrate Touch", "", s); break;
#endif
  }
}

static void aboutScreen() {
  tft->fillScreen(COL_BG);
  drawHeader("About", true);
#ifdef MARAUDER_V8
  const int dName = 26, dSub = 17, dAuth = 18, dRule = 6, dRow = 17, dGap = 2, dRule2 = 6, dCred = 16;
  const int valX = 92;
#else
  const int dName = 32, dSub = 22, dAuth = 24, dRule = 10, dRow = 21, dGap = 4, dRule2 = 8, dCred = 20;
  const int valX = 120;
#endif
  int cx = SCRW / 2, y = CONTENTY + 12;
  tft->setTextColor(COL_FG, COL_BG);
  tft->setTextDatum(MC_DATUM);
  drawStr(FW_NAME, cx, y, 4); y += dName;
  drawStr(String("Version ") + FW_VERSION, cx, y, 2); y += dSub;
  tft->setTextColor(COL_DIM, COL_BG);
  drawStr("UI by " FW_AUTHOR, cx, y, 2); y += dAuth;
  tft->drawFastHLine(16, y, SCRW - 32, theme.neon(1, theme.edge())); y += dRule;

  tft->setTextDatum(TL_DATUM);
  auto row = [&](const char *label, const String &value) {
    tft->setTextColor(COL_DIM, COL_BG); drawStr(label, 16, y, 2);
    tft->setTextColor(COL_FG, COL_BG);  drawStr(value, valX, y, 2);
    y += dRow;
  };
  row("Board",   BOARD_NAME);
  row("MCU",     BOARD_MCU);
  row("Display", BOARD_DISPLAY);
  row("Touch",   BOARD_TOUCH);
  {
    size_t ps = ESP.getPsramSize();
    if (ps >= 1024 * 1024)  row("PSRAM", String((unsigned)((ps + 512 * 1024) / (1024 * 1024))) + " MB");
    else if (ps > 0)        row("PSRAM", String((unsigned)(ps / 1024)) + " KB");
    else                    row("PSRAM", "None");
  }
  {
    uint16_t total = 0;
    for (int i = 0; i < 4; i++) total += PUZ_BANK_COUNT[i];
    row("Puzzles", String(total));
  }
  row("Built",   __DATE__);
  row("Commit",  FW_COMMIT);

  y += dGap;
  tft->drawFastHLine(16, y, SCRW - 32, theme.neon(2, theme.edge())); y += dRule2;
  tft->setTextColor(COL_DIM, COL_BG);
  drawStr("Classic 9x9 Sudoku", 16, y, 2); y += dCred;
  drawStr("Puzzles: bundled dataset", 16, y, 2);

  statusLine("Tap to go back.", COL_DIM);
  uint16_t x, ty; waitTap(x, ty);
}

// ── Grid Look picker — a full-screen gallery of palette swatches ────────────
// Resolve a palette by cycle index (the last index is the theme-derived one).
static BoardPal palByIndex(uint8_t i) {
  if (i >= BOARD_PAL_THEME) return boardPalFromTheme(theme.bg(), theme.fg(), theme.dim(), theme.dark());
  return BOARD_PALS[i % BOARD_PAL_FIXED];
}
// One swatch: a mini 3x3 board in the palette (given, entry, conflict digits +
// selection/peer/same tints) with its name below and a ring when it is current.
static void drawSwatchSpr(TFT_eSprite &g, const uint8_t *&tk, int sx, int sy,
                          int slotW, int slotH, uint8_t idx, bool selected,
                          int labelH, uint8_t labelF) {
  BoardPal bp = palByIndex(idx);
  const int pad = 5;
  int avail = min(slotW - 2 * pad, slotH - labelH - 2 * pad);
  if (avail < 12) avail = 12;
  int cell = avail / 3, S = cell * 3;
  int ssx = sx + (slotW - S) / 2, ssy = sy + pad;

