H4W9/ESP32_Sudoku/ESP32_Sudoku.ino
      int rowTop = CY + row * ITEMH - (int)scroll;
      int h = (row <= SET_CHIP_MAX) ? chipHit(rowTop, setChipVal(row), pX, pY) : -1;

      switch (row) {
        case SET_THEME:  if (h >= 0) { theme.cycleTheme(h); theme.save(); applyThemeToViewManager(); full(); } break;
        case SET_ACCENT: if (h >= 0) { theme.cycleAccent(h); theme.save(); applyThemeToViewManager(); render(); } break;
        case SET_FONT:   if (h >= 0) { theme.cycleFontCol(h); theme.save(); applyThemeToViewManager(); recolor(); } break;
        case SET_GRID:   gridPickerScreen(); full(); break;
        case SET_PEERS:  if (h >= 0) { g_hlPeers   = !g_hlPeers;   cfgSave(); render(); } break;
        case SET_SAME:   if (h >= 0) { g_hlSame    = !g_hlSame;    cfgSave(); render(); } break;
        case SET_AUTONOTE:if (h >= 0){ g_autoNotes = !g_autoNotes; cfgSave(); render(); } break;
        case SET_TIMER:  if (h >= 0) { g_showTimer = !g_showTimer; cfgSave(); render(); } break;
        case SET_MLIMIT:
          if (h == 1)      g_mistakeLim = (g_mistakeLim == 0) ? 3 : (g_mistakeLim == 3) ? 5 : 0;
          else if (h == 0) g_mistakeLim = (g_mistakeLim == 0) ? 5 : (g_mistakeLim == 5) ? 3 : 0;
          if (h >= 0) { cfgSave(); render(); } break;
        case SET_BRIGHT: if (h == 0 && theme.bright > 0) theme.bright--;
                         else if (h == 1 && theme.bright < 19) theme.bright++;
                         if (h >= 0) { theme.save(); applyBrightness(); render(); } break;
        case SET_LED:    if (h == 0 && theme.led_bright > 0) theme.led_bright--;
                         else if (h == 1 && theme.led_bright < 20) theme.led_bright++;
                         if (h >= 0) { theme.save(); render(); }
                         ledPreview(); break;
        case SET_ABOUT:  aboutScreen(); full(); break;
#ifndef HAS_CAP_TOUCH
        case SET_CAL:    touchCalRun(); full(); break;
#endif
        default: break;
      }
    } else if (fabs(fling) > 25) {
      scroll += fling * 0.016f;
      fling *= 0.95f;
      render();
    } else {
      fling = 0;
    }
    wasDown = down;
    delay(10);
  }
}

static String fmtTime(uint32_t sec) {
  char b[12];
  if (sec >= 3600) snprintf(b, sizeof(b), "%lu:%02lu:%02lu", (unsigned long)(sec/3600), (unsigned long)((sec/60)%60), (unsigned long)(sec%60));
  else             snprintf(b, sizeof(b), "%lu:%02lu", (unsigned long)(sec/60), (unsigned long)(sec%60));
  return String(b);
}

static void statsScreen() {
  tft->fillScreen(COL_BG);
  drawHeader("Statistics", true);
#ifdef MARAUDER_V8
  int y = CONTENTY + 8, rowH = 22; uint8_t hf = 2;
#else
  int y = CONTENTY + 14, rowH = 30; uint8_t hf = 4;
#endif
  tft->setTextDatum(TL_DATUM);
  // Column header
  tft->setTextColor(COL_DIM, COL_BG);
  int cW = SCRW / 4;
  drawStr("Level",  10,          y, 2);
  drawStr("Played", cW + 4,      y, 1);
  drawStr("Won",    2*cW + 8,    y, 1);
  drawStr("Best",   3*cW,        y, 1);
  y += (hf == 4 ? 24 : 18);
  tft->drawFastHLine(8, y - 4, SCRW - 16, theme.edge());
  for (int i = 0; i < 4; i++) {
    tft->setTextColor(COL_FG, COL_BG);
    drawStr(PUZ_DIFF_NAME[i], 10, y, 2);
    tft->setTextColor(COL_DIM, COL_BG);
    drawStr(String(g_played[i]), cW + 4,   y, 2);
    drawStr(String(g_won[i]),    2*cW + 8, y, 2);
    drawStr(g_best[i] ? fmtTime(g_best[i]) : String("--"), 3*cW, y, 2);
    y += rowH;
  }
  y += 6;
  uint32_t tp = 0, tw = 0;
  for (int i = 0; i < 4; i++) { tp += g_played[i]; tw += g_won[i]; }
  tft->setTextColor(COL_FG, COL_BG);
  drawStr(String("Total solved: ") + tw + " / " + tp, 10, y, 2);

  statusLine("Tap to go back.", COL_DIM);
  uint16_t x, ty; waitTap(x, ty);
}

// ════════════════════════════════════════════════════════════════════════════
//  Sudoku board view — PORTRAIT, composited into one PSRAM sprite per frame.
// ════════════════════════════════════════════════════════════════════════════
#ifdef MARAUDER_V8
static const int IH       = 22;   // info bar
static const int GTOPGAP  = 3;
static const int GCELL    = 22;   // 9*22 = 198
static const int ACTH     = 28;
static const int NUMH     = 30;
static const int STRIPGAP = 3;
static const uint8_t CELLFONT = 2;   // 14 px firm digits
static const uint8_t NUMFONT  = 2;
static const uint8_t NOTEFONT = 1;   // 10 px pencil marks
#else
static const int IH       = 28;
static const int GTOPGAP  = 6;
static const int GCELL    = 34;   // 9*34 = 306
static const int ACTH     = 42;
static const int NUMH     = 46;
static const int STRIPGAP = 6;
static const uint8_t CELLFONT = 4;   // 22 px
static const uint8_t NUMFONT  = 4;
static const uint8_t NOTEFONT = 1;
#endif
static const int GRIDSZ = GCELL * 9;
static const int GX     = (SCRW - GRIDSZ) / 2;
static const int GY     = HDRH + IH + GTOPGAP;
static const int NUMY   = SCRH - NUMH - 4;
static const int ACTY   = NUMY - ACTH - STRIPGAP;

static TFT_eSprite *g_cs = nullptr;      // content sprite, SCRW x (SCRH-HDRH), pushed at (0,HDRH)
static const uint8_t *g_csFont = nullptr;
static const int CSH = SCRH - HDRH;
#define SY(v) ((v) - HDRH)               // screen-y -> content-sprite-y

static bool gSpriteBegin() {
  g_cs = new TFT_eSprite(tft);
  g_cs->setColorDepth(16);
  if (!g_cs->createSprite(SCRW, CSH)) { delete g_cs; g_cs = nullptr; return false; }
  return true;
}
static void gSpriteEnd() {
  if (g_cs) { g_cs->deleteSprite(); delete g_cs; g_cs = nullptr; }
}

static uint32_t elapsedSec() {
  return g_elapsedMs / 1000 + (g_running ? (millis() - g_startMs) / 1000 : 0);
}
static bool isPeer(int a, int b) {
  if (a == b) return false;
  return (a / 9 == b / 9) || (a % 9 == b % 9) ||
         ((a / 9) / 3 == (b / 9) / 3 && (a % 9) / 3 == (b % 9) / 3);
}
// A cell shows red when its value disagrees with the unique solution.
static bool cellWrong(int i) {
  uint8_t v = g_sud.value(i);
  return v != 0 && !g_sud.isGiven(i) && v != g_sud.solution(i);
}

// Number-pad geometry: 9 keys across the grid width.
static int numKeyW() { return GRIDSZ / 9; }
static int numKeyX(int d /*1..9*/) { return GX + (d - 1) * numKeyW(); }
// Action row: 4 buttons across the grid width.
static const char *ACT_LABEL[4] = { "Undo", "Erase", "Notes", "Hint" };
static int actKeyW() { return GRIDSZ / 4; }
static int actKeyX(int i) { return GX + i * actKeyW(); }

static void gDrawInto(TFT_eSprite &cs) {
  cs.fillSprite(COL_BG);
  BoardPal bp = theme.board();

  // ── info bar ──
  int iy = SY(HDRH);
  cs.setTextDatum(ML_DATUM);
  cs.setTextColor(COL_FG, COL_BG);
  sprStr(cs, g_csFont, PUZ_DIFF_NAME[g_sud.difficulty()], 10, iy + IH / 2, 2);
  if (g_showTimer) {
    cs.setTextDatum(MC_DATUM);
    sprStr(cs, g_csFont, fmtTime(elapsedSec()), SCRW / 2, iy + IH / 2, 2);
  }
  cs.setTextDatum(MR_DATUM);
  String rstat;
  if (g_mistakeLim) rstat = String("X ") + g_mistakes + "/" + g_mistakeLim;
  else if (g_mistakes) rstat = String("X ") + g_mistakes;
  else rstat = String(g_sud.filledCount()) + "/81";
  cs.setTextColor(g_mistakeLim && g_mistakes >= g_mistakeLim ? bp.badText : COL_DIM, COL_BG);
  sprStr(cs, g_csFont, rstat, SCRW - 10, iy + IH / 2, 2);
  cs.setTextDatum(TL_DATUM);

  // ── grid cells (fills) ──
  int gy = SY(GY);
  for (int i = 0; i < 81; i++) {
    int r = i / 9, c = i % 9;
    int x = GX + c * GCELL, y = gy + r * GCELL;
    uint16_t fill;
    if (cellWrong(i))                                             fill = bp.badFill;
    else if (i == g_sel)                                          fill = bp.sel;
    else if (g_hlSame && g_sel >= 0 && g_sud.value(i) != 0 &&
             g_sud.value(i) == g_sud.value(g_sel))                fill = bp.same;
    else if (g_hlPeers && g_sel >= 0 && isPeer(i, g_sel))         fill = bp.peer;
    else                                                          fill = g_sud.isGiven(i) ? bp.givenCell : bp.paper;
    cs.fillRect(x, y, GCELL, GCELL, fill);
  }
  // ── grid lines ──
  for (int k = 0; k <= 9; k++) {
    bool thick = (k % 3 == 0);
    uint16_t col = thick ? bp.lineThick : bp.lineThin;
    int gx = GX + k * GCELL;
    cs.drawFastVLine(gx, gy, GRIDSZ, col);
    cs.drawFastHLine(GX, gy + k * GCELL, GRIDSZ, col);
    if (thick) {   // 2 px for the box rules / border
      cs.drawFastVLine(gx - 1, gy, GRIDSZ, col);
      cs.drawFastHLine(GX, gy + k * GCELL - 1, GRIDSZ, col);
    }
  }
  // ── digits + notes ──
  for (int i = 0; i < 81; i++) {
    int r = i / 9, c = i % 9;
    int x = GX + c * GCELL, y = gy + r * GCELL;
    uint8_t v = g_sud.value(i);
    if (v) {
      uint16_t tc = cellWrong(i) ? bp.badText
                  : g_sud.isGiven(i) ? bp.givenText
                  : g_hintCell[i] ? bp.hintText : bp.entryText;
      cs.setTextColor(tc);
      cs.setTextDatum(MC_DATUM);
      sprStr(cs, g_csFont, String((char)('0' + v)), x + GCELL / 2, y + GCELL / 2 + 1, CELLFONT);
    } else if (g_sud.notes(i)) {
      cs.setTextColor(bp.noteText);
      cs.setTextDatum(MC_DATUM);
      int sub = GCELL / 3;
      for (uint8_t d = 1; d <= 9; d++) {
        if (!g_sud.hasNote(i, d)) continue;
        int nx = x + ((d - 1) % 3) * sub + sub / 2;
        int ny = y + ((d - 1) / 3) * sub + sub / 2;
        sprStr(cs, g_csFont, String((char)('0' + d)), nx, ny, NOTEFONT);
      }
    }
  }
  cs.setTextDatum(TL_DATUM);

