H4W9/ESP32_Sudoku/ESP32_Sudoku.ino
  // ── action row ──
  int aw = actKeyW(), ay = SY(ACTY);
  for (int i = 0; i < 4; i++) {
    int bx = actKeyX(i) - GX + GX;   // = actKeyX(i)
    bool on = (i == 2 && g_notesMode);
    uint16_t bg = on ? theme.sel() : COL_ACCENT;
    cs.fillRoundRect(bx + 2, ay, aw - 4, ACTH, 6, bg);
    cs.drawRoundRect(bx + 2, ay, aw - 4, ACTH, 6, theme.neon(i, COL_DIM));
    bool dim = (i == 0 && !g_sud.canUndo());
    cs.setTextColor(dim ? COL_DIM : COL_FG, bg);
    cs.setTextDatum(MC_DATUM);
    sprStr(cs, g_csFont, ACT_LABEL[i], bx + aw / 2, ay + ACTH / 2, 2);
  }
  // ── number row ──
  int nw = numKeyW(), ny = SY(NUMY);
  for (int d = 1; d <= 9; d++) {
    int bx = numKeyX(d);
    bool done = g_sud.digitExhausted(d);
    cs.fillRoundRect(bx + 1, ny, nw - 2, NUMH, 5, COL_ACCENT);
    cs.drawRoundRect(bx + 1, ny, nw - 2, NUMH, 5, theme.neon(d, COL_DIM));
    cs.setTextColor(done ? COL_DIM : COL_FG, COL_ACCENT);
    cs.setTextDatum(MC_DATUM);
    sprStr(cs, g_csFont, String((char)('0' + d)), bx + nw / 2, ny + NUMH / 2 + 1, NUMFONT);
    // Tiny remaining-count (9 minus placed) in the key's top-left corner.
    int rem = 9 - g_sud.countOf((uint8_t)d);
    if (rem > 0) {
      cs.setTextColor(COL_DIM, COL_ACCENT);
      cs.setTextDatum(TL_DATUM);
      sprStr(cs, g_csFont, String(rem), bx + 4, ny + 2, 1);
    }
  }
  cs.setTextDatum(TL_DATUM);
}

static void gRender() {
  if (!g_cs) return;
  g_csFont = nullptr;
  gDrawInto(*g_cs);
  g_cs->pushSprite(0, HDRH);
}

// Momentary "key pressed" feedback: paint the tapped key light-gray straight to
// the panel for a beat, matching the shell keyboard. The next gRender() repaints
// it in its normal colour, so the highlight reads as a quick flash.
static const uint16_t KEY_FLASH = 0xBDF7;   // light gray (same as the shell keyboard)
static void flashKey(int bx, int by, int bw, int bh, int radius,
                     const String &label, uint8_t font, bool dim) {
  tft->fillRoundRect(bx, by, bw, bh, radius, KEY_FLASH);
  tft->drawRoundRect(bx, by, bw, bh, radius, theme.neon(0, COL_DIM));
  tft->setTextColor(dim ? COL_DIM : contrastOn(KEY_FLASH), KEY_FLASH);
  tft->setTextDatum(MC_DATUM);
  drawStr(label, bx + bw / 2, by + bh / 2 + 1, font);
  tft->setTextDatum(TL_DATUM);
  delay(70);
}
static void flashNumKey(int d) {
  int nw = numKeyW();
  flashKey(numKeyX(d) + 1, NUMY, nw - 2, NUMH, 5,
           String((char)('0' + d)), NUMFONT, g_sud.digitExhausted((uint8_t)d));
}
static void flashActKey(int i) {
  int aw = actKeyW();
  flashKey(actKeyX(i) + 2, ACTY, aw - 4, ACTH, 6,
           ACT_LABEL[i], 2, (i == 0 && !g_sud.canUndo()));
}

// Screen point -> cell index, or -1.
static int cellAt(int x, int y) {
  if (x < GX || x >= GX + GRIDSZ || y < GY || y >= GY + GRIDSZ) return -1;
  int c = (x - GX) / GCELL, r = (y - GY) / GCELL;
  if (c < 0 || c > 8 || r < 0 || r > 8) return -1;
  return r * 9 + c;
}
static int numAt(int x, int y) {
  if (y < NUMY || y >= NUMY + NUMH) return -1;
  int nw = numKeyW();
  int d = (x - GX) / nw + 1;
  return (d >= 1 && d <= 9 && x >= GX && x < GX + GRIDSZ) ? d : -1;
}
static int actAt(int x, int y) {
  if (y < ACTY || y >= ACTY + ACTH) return -1;
  int aw = actKeyW();
  int i = (x - GX) / aw;
  return (i >= 0 && i <= 3 && x >= GX && x < GX + GRIDSZ) ? i : -1;
}

static void recordWin() {
  uint8_t d = g_sud.difficulty();
  g_played[d]++; g_won[d]++;
  uint32_t t = elapsedSec();
  if (g_best[d] == 0 || t < g_best[d]) g_best[d] = t;
  statsSave();
}

// Enter a digit at the selected cell (or toggle a note). Returns true if changed.
static bool enterDigit(uint8_t d) {
  if (g_sel < 0 || g_sud.isGiven(g_sel)) return false;
  if (g_notesMode) {
    return g_sud.toggleNote(g_sel, d);
  }
  if (g_sud.value(g_sel) == d) return g_sud.clearCell(g_sel);   // tap-again clears
  g_hintCell[g_sel] = false;
  bool changed = g_sud.setValue(g_sel, d, g_autoNotes);
  if (changed && d != g_sud.solution(g_sel)) g_mistakes++;
  return changed;
}

static void gameScreen() {
  if (!gSpriteBegin()) {
    msgScreen("Sudoku", "Out of memory", "The board needs PSRAM. Enable it in Tools.", TFT_RED);
    return;
  }
  tft->fillScreen(COL_BG);
  drawHeader("Sudoku", true);
  g_startMs = millis();
  g_running = true;
  gRender();

  bool wasDown = false;
  uint16_t pX = 0, pY = 0;
  bool moved = false;
  uint32_t lastTick = millis();

  for (;;) {
    touch->run();
    bool down = touch->isPressed();
    uint16_t x = touch->x(), y = touch->y();

    if (down && !wasDown) { pX = x; pY = y; moved = false; }
    else if (down && wasDown) { if (abs((int)x - pX) > 8 || abs((int)y - pY) > 8) moved = true; }
    else if (!down && wasDown && !moved) {
      // ── a tap ──
      if (backTapped(pX, pY)) {
        g_elapsedMs += (millis() - g_startMs); g_running = false;
        gameSave();
        gSpriteEnd();
        return;
      }
      bool changed = false, flashed = false;
      int cell = cellAt(pX, pY);
      int num  = numAt(pX, pY);
      int act  = actAt(pX, pY);
      if (cell >= 0) { if (g_sel != cell) { g_sel = cell; changed = true; } }
      else if (num >= 1) { flashNumKey(num); flashed = true; changed = enterDigit((uint8_t)num); }
      else if (act >= 0) {
        flashActKey(act); flashed = true;
        switch (act) {
          case 0: changed = g_sud.undo(); break;
          case 1: if (g_sel >= 0) { g_hintCell[g_sel] = false; changed = g_sud.clearCell(g_sel); } break;
          case 2: g_notesMode = !g_notesMode; changed = true; break;
          case 3: if (g_sel >= 0 && !g_sud.isGiven(g_sel) && g_sud.value(g_sel) != g_sud.solution(g_sel)) {
                    g_hintCell[g_sel] = true; g_hintsUsed++;
                    changed = g_sud.applyHint(g_sel);
                  } break;
        }
      }
      if (!changed && flashed) gRender();   // no state change: repaint to clear the flash
      if (changed) {
        gRender();
        // ── win? ──
        if (g_sud.isSolved()) {
          g_elapsedMs += (millis() - g_startMs); g_running = false;
          recordWin();
          gameDeleteSave();
          g_gameActive = false;
          gSpriteEnd();
          ledBlinkOk(400);
          msgScreen("Solved!", fmtTime(elapsedSec()),
                    String(PUZ_DIFF_NAME[g_sud.difficulty()]) + " completed" +
                    (g_hintsUsed ? String(" — ") + g_hintsUsed + " hint" + (g_hintsUsed > 1 ? "s" : "") : String("")),
                    COL_OK);
          return;
        }
        // ── mistake limit reached? ──
        if (g_mistakeLim && g_mistakes >= g_mistakeLim) {
          g_elapsedMs += (millis() - g_startMs); g_running = false;
          g_played[g_sud.difficulty()]++; statsSave();
          gameDeleteSave();
          g_gameActive = false;
          gSpriteEnd();
          msgScreen("Game Over", "Too many mistakes",
                    String("You reached ") + g_mistakeLim + " mistakes.", TFT_RED);
          return;
        }
      }
    }
    wasDown = down;

    // ── 1 Hz timer refresh ──
    if (g_showTimer && millis() - lastTick >= 1000) {
      lastTick = millis();
      gRender();
    }
    delay(10);
  }
}

// New game — difficulty picker, then load a random puzzle from that tier.
static void resetMeta() {
  g_sel = -1; g_notesMode = false; g_mistakes = 0; g_hintsUsed = 0;
  g_elapsedMs = 0; g_running = false;
  for (int i = 0; i < 81; i++) g_hintCell[i] = false;
}
static void newGameFlow() {
  String rows[4];
  for (int i = 0; i < 4; i++)
    rows[i] = String(PUZ_DIFF_NAME[i]) + "  (" + PUZ_BANK_COUNT[i] + ")";
  int pick = scrollList("New Game", rows, 4, true);
  if (pick < 0) return;
  uint16_t idx = (uint16_t)random(PUZ_BANK_COUNT[pick]);
  g_sud.loadFromBank((uint8_t)pick, idx);
  resetMeta();
  g_gameActive = true;
  gameScreen();
}

// ════════════════════════════════════════════════════════════════════════════
//  Main menu
// ════════════════════════════════════════════════════════════════════════════
static const char *MENU_ITEMS[] = { "New Game", "Continue", "Statistics", "Settings", "About" };
static const int    MENU_COUNT  = 5;
static const int    MENU_MARGIN = 16;
static const int    MENU_TOP    = CONTENTY + 12;
static const int    MENU_GAP    = 12;
static int menuBtnH() {
  int avail = SCRH - MENU_TOP - 12;
  return (avail - (MENU_COUNT - 1) * MENU_GAP) / MENU_COUNT;
}
static int menuBtnY(int i) { return MENU_TOP + i * (menuBtnH() + MENU_GAP); }
static int menuButtonAt(uint16_t x, uint16_t y) {
  if ((int)x < MENU_MARGIN || (int)x >= SCRW - MENU_MARGIN) return -1;
  int bh = menuBtnH();
  for (int i = 0; i < MENU_COUNT; i++) {
    int by = menuBtnY(i);
    if ((int)y >= by && (int)y < by + bh) return i;
  }
  return -1;
}
static void drawMenu() {
  tft->fillScreen(COL_BG);
  drawHeader(FW_NAME, false);
  int bh = menuBtnH();
  for (int i = 0; i < MENU_COUNT; i++) {
    int y = menuBtnY(i);
    tft->fillRoundRect(MENU_MARGIN, y, SCRW - 2 * MENU_MARGIN, bh, 12, COL_ACCENT);
    tft->drawRoundRect(MENU_MARGIN, y, SCRW - 2 * MENU_MARGIN, bh, 12, theme.neon(i * 3, COL_DIM));
    tft->setTextColor(COL_FG, COL_ACCENT);
    tft->setTextDatum(MC_DATUM);
#ifdef MARAUDER_V8
    drawStr(MENU_ITEMS[i], SCRW / 2, y + bh / 2, 2);
#else
    drawStr(MENU_ITEMS[i], SCRW / 2, y + bh / 2, 4);
#endif
  }
  tft->setTextDatum(TL_DATUM);
}
static void openMenuItem(int i) {
  switch (i) {
    case 0: newGameFlow(); break;
    case 1:
      if (g_gameActive) { gameScreen(); break; }
      if (gameLoad()) { gameScreen(); }
      else msgScreen("Continue", "No saved game",
                     "Start a new game — it saves automatically when you leave the board.", COL_DIM);
      break;
    case 2: statsScreen();  break;
    case 3: settingsFlow(); break;
    case 4: aboutScreen();  break;
    default: break;
  }
  drawMenu();
}

static bool mainMenuStart(ViewManager *viewManager) {
  drawMenu();
  return true;
}
static void mainMenuRun(ViewManager *viewManager) {
  static bool wasDown = false;
  TouchInput *t = viewManager->getInputManager()->getTouch();
  bool down = t->isPressed();
  if (down && !wasDown) {
    uint16_t x = t->x(), y = t->y();
    int btn = menuButtonAt(x, y);
    if (btn >= 0) openMenuItem(btn);
  }
  wasDown = down;

  static uint32_t lastRefresh = 0;
  if (millis() - lastRefresh > 5000) {
    lastRefresh = millis();
    drawHeaderStatus();
    drawHeaderMem(false);
  }
}
static const PROGMEM View mainMenuView = View("MainMenu", mainMenuRun, mainMenuStart, nullptr);

// ════════════════════════════════════════════════════════════════════════════
//  Arduino entry points
// ════════════════════════════════════════════════════════════════════════════
void setup() {
  randomSeed(esp_random());
#ifndef DEVELOPER
  esp_log_level_set("*", ESP_LOG_NONE);
#endif
  Serial.begin(115200);
  uint32_t t0 = millis();
  while (!Serial && (millis() - t0) < 1500) delay(10);
  Serial.println(F("[" BOARD_NAME "] Sudoku starting..."));

  pinMode(TFT_BL, OUTPUT);
#if ESP_ARDUINO_VERSION_MAJOR >= 3
  ledcAttach(TFT_BL, 5000, 8);
  ledcWrite(TFT_BL, 0);
#else
  ledcSetup(0, 5000, 8);
  ledcAttachPin(TFT_BL, 0);
  ledcWrite(0, 0);
#endif

#ifdef HAS_C5_SD
  sharedSPI.begin(SD_SCK, SD_MISO, SD_MOSI);
  delay(100);
  g_sdOk = SD.begin(SD_CS, sharedSPI);
#else
  g_sdOk = SD.begin(SD_CS);
#endif
  Serial.println(g_sdOk ? F("[" BOARD_NAME "] SD OK") : F("[" BOARD_NAME "] SD absent (SPIFFS saves)"));

  if (!SPIFFS.begin(true)) Serial.println(F("[" BOARD_NAME "] SPIFFS mount failed"));

#ifdef HAS_PSRAM
  if (!psramInit()) Serial.println(F("[" BOARD_NAME "] PSRAM unavailable"));
#endif

#ifdef HAS_CAP_TOUCH
  ft6336_init();
#else
  Wire.begin(I2C_SDA, I2C_SCL, 400000U);
#endif
  battInit();

  theme.load();
  cfgLoad();
  statsLoad();
  ledOff();

#ifdef MARAUDER_V8
  vm = new ViewManager(MarauderV8Config);
#else
  vm = new ViewManager(PancakeConfig);
#endif
  tft   = vm->getDraw()->display->getTFT();
  touch = vm->getInputManager()->getTouch();
  applyThemeToViewManager();
  applyBrightness();

#ifndef HAS_CAP_TOUCH
  if (touch) touch->attachTFT(tft);
  touchCalInit();
#endif

  vm->add(&mainMenuView);
  vm->set("MainMenu");
  Serial.println(F("[" BOARD_NAME "] Ready."));
}

void loop() {
  vm->run();
}
